---
kind: property
id: P:Autodesk.Revit.DB.Architecture.TopographySurface.AssociatedBuildingPadId
source: html/87a734f3-ccd0-78cc-a2f5-f5f2ef6fb9be.htm
---
# Autodesk.Revit.DB.Architecture.TopographySurface.AssociatedBuildingPadId Property

The element id of the building pad which causes this topography surface to be formed.

## Syntax (C#)
```csharp
public ElementId AssociatedBuildingPadId { get; }
```

## Remarks
InvalidElementId returned signals that there is no associated building pad.